app/Controllers/admin/Aktivitas.php

SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $aktivitas_model = new AktivitasModel();
        $all_data_aktivitas = $aktivitas_model->findAll();

SELECT *
FROM `tb_aktivitas`
WHERE `tb_aktivitas`.`id_aktivitas` = '6'
---
    public function edit($id_aktivitas)
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $aktivitas_model = new AktivitasModel();
        $aktivitasData = $aktivitas_model->find($id_aktivitas);

SELECT *
FROM `tb_aktivitas`
WHERE `tb_aktivitas`.`id_aktivitas` = '7'
---
    public function proses_edit($id_aktivitas = null)
    {
        if (!$id_aktivitas) {
            return redirect()->back();
        }

        date_default_timezone_set('Asia/Jakarta');
        $file_foto = $this->request->getFile('foto_aktivitas');
        $currentDateTime = date('dmYHis');
        $nama_aktivitas_in = $this->request->getVar("nama_aktivitas_in");
        $nama_aktivitas_en = $this->request->getVar("nama_aktivitas_en");
        $meta_title_id = $this->request->getVar("meta_title_id");
        $meta_title_en = $this->request->getVar("meta_title_en");
        $meta_description_id = $this->request->getVar("meta_description_id");
        $meta_description_en = $this->request->getVar("meta_description_en");

        $aktivitasModel = new AktivitasModel();
        $aktivitasData = $aktivitasModel->find($id_aktivitas);