app/Controllers/admin/Dashboardctrl.php

    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $produkModel = new ProdukModel();
        $aktivitasModel = new AktivitasModel();
        $sliderModel = new SliderModel();
        $artikelModel = new ArtikelModel();

        $data['productCount'] = $produkModel->countAll();
        $data['aktivitasCount'] = $aktivitasModel->countAll();
        $data['sliderCount'] = $sliderModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tb_produk`
SELECT COUNT(*) AS `numrows` FROM `tb_aktivitas`
SELECT COUNT(*) AS `numrows` FROM `tb_slider`