app/Controllers/admin/Produk.php

SELECT *
FROM `tb_produk`
---
    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $produk_model = new ProdukModel();
        $all_data_produk = $produk_model->findAll();

SELECT *
FROM `tb_produk`
WHERE `tb_produk`.`id_produk` = '8'
---
    public function edit($id_produk)
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login')); // Ubah 'login' sesuai dengan halaman login kamu
        }
        $produk_model = new ProdukModel();
        $produkData = $produk_model->find($id_produk);

SELECT *
FROM `tb_produk`
WHERE `tb_produk`.`id_produk` = '8'
---
    public function proses_edit($id_produk = null)
    {
        if (!$id_produk) {
            return redirect()->back();
        }

        $produkModel = new ProdukModel();
        $produkData = $produkModel->find($id_produk);