app/Controllers/user/Aktivitasctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Aktivitas'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`
SELECT *
FROM `tb_profil`
---
    public function index()
    {

        $pageName = 'Aktivitas';
        $meta = $this->MetaModel->where('nama_halaman', $pageName)->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'meta' => $meta,
        ];

SELECT *
FROM `tb_aktivitas`
WHERE `slug_in` = 'joint-cooking-class'
OR `slug_en` = 'joint-cooking-class'
 LIMIT 1
SELECT *
FROM `tb_profil`
---
    public function detail($slug)
    {
        $locale = session('lang') ?? 'id'; // Default to 'id' if no session language is set

        $aktivitas = $this->AktivitasModel->where('slug_in', $slug)
            ->orWhere('slug_en', $slug)
            ->first();

        if (!$aktivitas) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Aktivitas dengan slug $slug tidak ditemukan");
        }

        // Tentukan slug yang benar berdasarkan bahasa yang dipilih
        $slug_id = $aktivitas->slug_in;
        $slug_en = $aktivitas->slug_en;
        $slug_baru = ($locale === 'id') ? $slug_id : $slug_en;

         // Tentukan prefix URL berdasarkan bahasa
         $prefix_url = ($locale === 'id') ? 'aktivitas' : 'activities';

         // Jika slug di URL tidak sesuai dengan bahasa yang dipilih, redirect ke slug yang benar
         if ($slug !== $slug_baru) {
             return redirect()->to(base_url($locale . '/' . $prefix_url . '/' . $slug_baru));
         }


        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findBySlug($slug, $locale),
        ];