app/Controllers/user/Artikelctrl.php

    public function index()
    {

        $pageName = 'Artikel';
        $meta = $this->MetaModel->where('nama_halaman', $pageName)->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'meta' => $meta,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Artikel'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`

    public function detail($slug)
    {
        $locale = session('lang') ?? 'id';
        $artikel = $this->ArtikelModel->where('slug_in', $slug)
            ->orWhere('slug_en', $slug)
            ->first();

        if (!$artikel) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Artikel dengan slug $slug tidak ditemukan");
        }

        // Tentukan slug yang benar berdasarkan bahasa yang dipilih
        $slug_id = $artikel->slug_in;
        $slug_en = $artikel->slug_en;
        $slug_baru = ($locale === 'id') ? $slug_id : $slug_en;

        // Tentukan prefix URL berdasarkan bahasa
        $prefix_url = ($locale === 'id') ? 'artikel' : 'articles';

        // Jika slug di URL tidak sesuai dengan bahasa yang dipilih, redirect ke slug yang benar
        if ($slug !== $slug_baru) {
            return redirect()->to(base_url($locale . '/' . $prefix_url . '/' . $slug_baru));
        }

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'artikel' => $artikel,
            'artikel_lain' => $this->ArtikelModel->getArtikelLainnya($artikel->id_artikel, 4),
            'locale' => $locale,
        ];
---
SELECT *
FROM `tb_artikel`
WHERE `slug_in` = 'Picnic in the Middle of Nature: Enjoying the Beauty with Your Partner'
OR `slug_en` = 'Picnic in the Middle of Nature: Enjoying the Beauty with Your Partner'
 LIMIT 1
SELECT *
FROM `tb_profil`