app/Controllers/user/Contactctrl.php

    public function index()
    {
        $pageName = 'Kontak';
        $meta = $this->MetaModel->where('nama_halaman', $pageName)->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'meta' => $meta,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Kontak'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_profil`