app/Controllers/user/Homectrl.php

    public function index()
    {


        // Existing code to fetch data, including meta data for the page
        $pageName = 'Beranda';
        $meta = $this->MetaModel->where('nama_halaman', $pageName)->first();

        // Fetch other required data
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'meta' => $meta,  // Pass the meta data to the view
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Beranda'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_profil`