app/Controllers/user/Productsctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Layanan'
 LIMIT 1
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_aktivitas`
---
    public function index()
    {

        $pageName = 'Layanan';
        $meta = $this->MetaModel->where('nama_halaman', $pageName)->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'tbproduk' => $this->ProdukModel->getAllProducts(),
            'meta' => $meta,
        ];

SELECT *
FROM `tb_produk`
WHERE `slug_in` = 'Custom Tour Packages'
OR `slug_en` = 'Custom Tour Packages'
 LIMIT 1
SELECT *
FROM `tb_profil`
---
    public function detail($slug_produk)
    {
        // Get the current locale
        $locale = session('lang') ?? 'id';

        // Fetch the product by slug
        $produk = $this->ProdukModel->where('slug_in', $slug_produk)
        ->orWhere('slug_en', $slug_produk)
        ->first();

    if (!$produk) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException("Produk dengan slug $slug_produk tidak ditemukan");
    }

    // Tentukan slug yang benar berdasarkan bahasa yang dipilih
    $slug_id = $produk->slug_in;
    $slug_en = $produk->slug_en;
    $slug_baru = ($locale === 'id') ? $slug_id : $slug_en;

    // Tentukan prefix URL berdasarkan bahasa
    $prefix_url = ($locale === 'id') ? 'layanan' : 'service';

    // Jika slug di URL tidak sesuai dengan bahasa yang dipilih, redirect ke slug yang benar
    if ($slug_produk !== $slug_baru) {
        return redirect()->to(base_url($locale . '/' . $prefix_url . '/' . $slug_baru));
    }


        // Prepare the data to be passed to the view
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbproduk' => $produk, // Use the fetched product

        ];