app/Controllers/Login.php

SELECT *
FROM `tb_profil`
WHERE `username` = 'user'
 LIMIT 1
---
    public function process()
    {
        $users = new ProfilModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'username' => $username,
        ])->first();