app/Models/AktivitasModel.php

    public function findBySlug($slug, $locale = 'en')
    {
        if ($locale === 'id') {
            return $this->where('slug_in', $slug)->first();
        } else {
            return $this->where('slug_en', $slug)->first();
---
SELECT *
FROM `tb_aktivitas`
WHERE `slug_en` = 'joint-cooking-class'
 LIMIT 1