app/Models/ArtikelModel.php

    public function getArtikelTerbaru()
    {
        return $this->orderBy('id_artikel', 'desc')
            ->findAll();
---
SELECT *
FROM `tb_artikel`
ORDER BY `id_artikel` DESC

    public function getArtikelLainnya($id_artikel, $limit = 4)
    {
        return $this->where('id_artikel !=', $id_artikel)
            ->orderBy('id_artikel', 'ASC')
            ->limit($limit)
            ->findAll();
---
SELECT *
FROM `tb_artikel`
WHERE `id_artikel` != '7'
ORDER BY `id_artikel` ASC