app/Models/ProdukModel.php

SELECT *
FROM `tb_produk`
ORDER BY `id_produk` ASC
---
    public function getAllProducts()
    {
        return $this->orderBy('id_produk', 'ASC')->findAll();